Revit 2026 API

# DistributionSysTypeNumWires Property

---

Get or set number of wires of distribution system.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumWires { get; set; }
```
```vb
Public Property NumWires As Integer
	Get
	Set
```
```cpp
public:
property int NumWires {
	int get ();
	void set (int value);
}
```
```fsharp
member NumWires : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | While assign a negative value to NumWires. |

#### Reference

DistributionSysType Class

Autodesk.Revit.DB.Electrical Namespace